# PANDAS I: DataFrames y Series

In [2]:
import pandas as pd
import numpy as np
import random

### 1. 쯈u칠 diferencia hay entre una Serie y un DataFrame?

Una serie es una estructura unidimensional y un DataFrame es una estructura bidimensional

### 2. Momento de trabajar con Series. Contestad a las siguientes preguntas:

- Crea dos listas:

    - Una que se llame "valores" que tenga 7 n칰meros aleatorios.
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los d칤as de la semana.

In [3]:
valores = random.sample(range(0,11), 7)
valores

[0, 9, 5, 3, 1, 8, 2]

In [4]:
indices = ["lunes", "martes", "miercoles", "jueves", "viernes", "sabado", "domingo"]
indices

['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo']

- A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los 칤ndices de la Serie.

In [5]:
serie1 = pd.Series(valores, index = indices)
serie1

lunes        0
martes       9
miercoles    5
jueves       3
viernes      1
sabado       8
domingo      2
dtype: int64

- A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el m칠todo zip que nos permite iterar por dos listas a la vez

In [6]:
zip1 = zip(indices, valores)
zip1

In [7]:
listzip = list(zip1)
listzip

[('lunes', 0),
 ('martes', 9),
 ('miercoles', 5),
 ('jueves', 3),
 ('viernes', 1),
 ('sabado', 8),
 ('domingo', 2)]

In [8]:
diccionario = {}
for k,v in listzip:
    diccionario.update({k:v})
diccionario

{'lunes': 0,
 'martes': 9,
 'miercoles': 5,
 'jueves': 3,
 'viernes': 1,
 'sabado': 8,
 'domingo': 2}

- Crea una Serie con el diccionario creado en el punto anterior.

In [9]:
serie2 = pd.Series(diccionario)
serie2

lunes        0
martes       9
miercoles    5
jueves       3
viernes      1
sabado       8
domingo      2
dtype: int64

- 쯈u칠 forma tiene esta 칰ltima Serie?

In [10]:
serie2.shape

(7,)

- 쯈u칠 tipo de datos tiene?

In [11]:
serie2.dtype

dtype('int64')

- 쯈u칠 tama침o tiene?

In [12]:
serie2.size

7

- 쮺u치les son los 칤ndices de la Serie?

In [13]:
serie2.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

- 쯏 los values?

In [14]:
serie2.values

array([0, 9, 5, 3, 1, 8, 2])

- Extraed el valor para el 칤ndice "lunes"

In [15]:
serie2.loc["lunes"]

0

- Extraed el valor para el 칤ndice "lunes", "martes" y "mi칠rcoles".

In [16]:
serie2.loc["lunes":"miercoles"]

lunes        0
martes       9
miercoles    5
dtype: int64

- Extraed el valor para el 칤ndice "lunes" y "domingo".

In [17]:
serie2.loc[["lunes", "domingo"]]

lunes      0
domingo    2
dtype: int64

### 3. Es el turno de los DataFrames

- Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [18]:
array = np.random.randint(0,100, (4,3))
array

array([[35, 94, 52],
       [55, 10, 87],
       [94, 36, 29],
       [51, 61, 27]])

- Convertid el array en un DataFrame donde las columnas se llamen "Espa침a", "Francia" e "Italia".

In [19]:
df1 = pd.DataFrame(array, columns = ["Espa침a", "Francia", "Italia"])
df1

   Espa침a  Francia  Italia
0      35       94      52
1      55       10      87
2      94       36      29
3      51       61      27

- Descargad el archivo "medallas" y cargad el DataFrame con la siguiente l칤nea de c칩digo:

df = pd.read_csv("medallas.csv", index_col=["Pa칤s"])

游늷 NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

In [20]:
df2 = pd.read_csv("medallas.csv", index_col = ["Pa칤s"])
df2

                 Unnamed: 0   Oro  Plata  Bronce
Pa칤s
China                     1  1473    994     720
Jap칩n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir치n                      4   179    181     197
Kazajist치n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip칠i              9    99    144     276
Corea del Norte          10    91    120     235

- Usando el loc extraed todas las columnas de la fila "Tailandia".

In [21]:
df2.loc["Tailandia"]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

- Usando el loc extraed todas las columnas de China e Ir치n.

In [22]:
df2.loc[("China", "Ir치n"), :]

       Unnamed: 0   Oro  Plata  Bronce
Pa칤s
China           1  1473    994     720
Ir치n            4   179    181     197

- Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir치n.

In [23]:
df2.loc[("China", "Ir치n"), ("Oro", "Plata", "Bronce")]

        Oro  Plata  Bronce
Pa칤s
China  1473    994     720
Ir치n    179    181     197

- Usando el iloc extraed la informaci칩n de la India. Devolved todas las columnas.

In [24]:
df2.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

- Usando el iloc extraed todas las columnas de los paises que est칠n en posici칩n impar. La primera que nos tendr칤a que salir es Jap칩n y la 칰ltima Corea del Norte.

In [25]:
df2.iloc[1::2]

                 Unnamed: 0   Oro  Plata  Bronce
Pa칤s
Jap칩n                     2  1032   1037     985
Ir치n                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

- Utilizando el c칩digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [30]:
df2.iloc[1::2,1:]

                  Oro  Plata  Bronce
Pa칤s
Jap칩n            1032   1037     985
Ir치n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

- Contestad a las siguientes preguntas:
    - 쯈u칠 pa칤s consigui칩 m치s de 200 medallas de oro?
    - 쯈u칠 pa칤s consigui칩 m치s de 200 medallas de oro y m치s de 1000 de plata?
    - 쯈u칠 pa칤s consigui칩 m치s de 200 medallas de oro o m치s de 700 de bronce?

In [37]:
print("Los pa칤ses que consiguieron m치s de 200 medallas de oro son:")
df2.loc[(df2.Oro>200), ["Oro"]]

Los pa칤ses que consiguieron m치s de 200 medallas de oro son:

                Oro
Pa칤s
China          1473
Jap칩n          1032
Corea del Sur   745

In [39]:
print("Los pa칤ses que consiguieron m치s de 200 medallas de oro y m치s de 1000 medallas de plata son:")
df2.loc[(df2.Oro>200) & (df2.Plata>1000), ["Oro", "Plata"]]

Los pa칤ses que consiguieron m치s de 200 medallas de oro y m치s de 1000 medallas de plata son:

        Oro  Plata
Pa칤s
Jap칩n  1032   1037

In [40]:
print("Los pa칤ses que consiguieron m치s de 200 medallas de oro o m치s de 700 medallas de bronce son:")
df2.loc[(df2.Oro>200) | (df2.Bronce>700), ["Oro", "Bronce"]]

Los pa칤ses que consiguieron m치s de 200 medallas de oro o m치s de 700 medallas de bronce son:

                Oro  Bronce
Pa칤s
China          1473     720
Jap칩n          1032     985
Corea del Sur   745     827

- Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [47]:
df3 = df2.drop(["Unnamed: 0"], axis=1)
df3

                  Oro  Plata  Bronce  Total
Pa칤s
China            1473    994     720   3187
Jap칩n            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Ir치n              179    181     197    557
Kazajist치n        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taip칠i       99    144     276    519
Corea del Norte    91    120     235    446

- Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa칤s.

In [48]:
df3["Total"] = df3["Oro"]+df3["Plata"]+df3["Bronce"]
df3

                  Oro  Plata  Bronce  Total
Pa칤s
China            1473    994     720   3187
Jap칩n            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Ir치n              179    181     197    557
Kazajist치n        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taip칠i       99    144     276    519
Corea del Norte    91    120     235    446